import React from "react";

import styles from "./agreement.module.css";

export const Agreement = () => {
  return (
    <section className={styles.main}>
      <div className={styles.text}>
        <h1>
          {" "}
          <strong>Пользовательское соглашение. Условия использования сайта</strong>{" "}
        </h1>
        <h2>1. Термины и определения</h2>
        <p>В настоящем Пользовательском соглашении (далее также – Соглашение) используются следующие термины и определения:</p>
        <p>
          1.1. Сайт (также – Портал) – Интернет-ресурс, расположенный в сети Интернет по адресу: https://www.безпересдач.рф
          (https://www.xn--80abjdaam8dkl2e.xn--p1ai), а также на всех субдоменах, относящихся к данному адресу, представляющий собой
          совокупность программного обеспечения Сайта, дизайна (графического оформления) Сайта, Баз данных, любого раздела (подраздела)
          Сайта, а также Информации, размещенной (размещаемой) на Сайте Администрацией Сайта и Пользователями Сайта.
        </p>
        <p>
          1.2. Администрация Сайта (далее также – Администрация) – владелец Сайта, которому принадлежат все соответствующие
          имущественные права на Сайт, включая исключительные права на доменное имя Сайта, а также уполномоченные на управление Сайтом
          владельцем Сайта сотрудники, осуществляющие его администрирование.
        </p>
        <p>
          1.3. Пользователь Сайта (далее также – Пользователь) – любое лицо, пришедшее на Сайт, в том числе осуществляющее использование
          Сайта в пределах функциональных возможностей Сайта.
        </p>
        <p>
          1.4. Использование Сайта – любые действия Пользователя Сайта в пределах функциональных возможностей Сайта, включая: просмотр
          информации, размещенной на Сайте, направление с использованием Сайта уведомлений, сообщений и иной информации в адрес
          Администрации Сайта или иным лицам, совершение сделок с Администрацией Сайта, исполнение и прекращение договоров с
          Администрацией Сайта, использование Сайта иным образом.
        </p>
        <p>
          1.5. Информация – любые сведения (сообщения, данные) независимо от формы их представления, размещаемые (размещенные)
          Администрацией Сайта или Пользователем Сайта на Сайте, включая: сведения информационно-познавательного характера, сведения об
          услугах, предоставляемых Администрацией Сайта и/или иными лицами, иные текстовые сообщения, фотографии (изображения), аудио-
          и/или видео-произведения, персональная информация Пользователя Сайта, ссылки на другие сайты и прочее.
        </p>
        <p>
          1.6. Персональная информация Пользователя – любая информация, относящаяся к прямо или косвенно определенному или определяемому
          физическому лицу (субъекту персональных данных – Пользователю Сайта), которую Пользователь предоставляет о себе самостоятельно
          в процессе любого использования Сайта (оставление комментариев, заполнение форм и проч.), включая персональные данные
          Пользователя, информацию, которая автоматически передается Администрации Сайта в процессе использования Сайта с помощью
          установленного на устройстве Пользователя программного обеспечения, в том числе IP-адрес, информация из cookie, информация о
          браузере пользователя, а также иные данные о Пользователе.
        </p>
        <h2>2. Общие положения</h2>
        <p>
          2.1. Администрация Сайта размещает на Сайте информацию ознакомительного характера, занимается предоставлением услуг по сбору и
          подготовке материалов для самостоятельного написания Пользователем студенческих, научных и иных квалификационных работ, а
          также предоставляет дополнительные вспомогательные услуги, направленные на помощь в обучении в учебных заведениях.
        </p>
        <p>
          2.2. Администрация Сайта предоставляет Пользователю доступ к использованию Сайта на условиях, изложенных в настоящем
          Соглашении.
        </p>
        <p>
          2.3. Пользователь обязан полностью ознакомиться с настоящим Соглашением до начала использования Сайта. Факт любого
          использования Сайта, в том числе простой просмотр Сайта, означает полное и безоговорочное принятие Пользователем настоящего
          Соглашения.
        </p>
        <p>
          2.4. Настоящее Соглашение может быть изменено и/или дополнено Администрацией Сайта в одностороннем порядке без какого-либо
          специального уведомления. Новая редакция Соглашения вступает в силу с момента ее размещения на Сайте, если иное не
          предусмотрено новой редакцией Соглашения. Продолжение использования Сайта Пользователем после внесения изменений и/или
          дополнений в настоящее Соглашение означает принятие и согласие Пользователя с такими изменениями и/или дополнениями.
        </p>
        <p>
          2.5. В случае несогласия Пользователя с настоящим Соглашением или его изменениями/дополнениями, Пользователь обязан отказаться
          от использования Сайта.
        </p>
        <p>
          2.6. Если законодательство страны, на территории которой Пользователь использует Сайт или гражданином (резидентом) которой он
          является, запрещает использовать предоставляемый Сайтом функционал, Пользователь обязан отказаться от использования Сайта.
        </p>
        <h2>3. Ограничение ответственности и гарантий</h2>
        <p>
          3.1. Вся информация, размещенная на Сайте, носит исключительно ознакомительный характер и не является рекламой или договором
          оферты.
        </p>
        <p>
          3.2. Администрация Сайта не гарантирует корректность, достоверность и полноту размещаемой (размещенной) информации на Сайте.
          Вся ответственность за последствия в связи с использованием Сайта возлагается на Пользователя.
        </p>
        <p>
          3.3. Администрация Сайта не несет ответственности за посещение и/или использование Пользователем Сайта внешних ресурсов,
          ссылки на которые могут содержаться на Сайте.
        </p>
        <p>
          3.4. Администрация Сайта не гарантирует постоянное и бесперебойное функционирование Сайта, актуальную информацию на Сайте,
          соответствие любой или выборочной информации на Сайте цели посещения Пользователем Сайта.
        </p>
        <p>3.5. Администрация Сайта не несет ответственности ни за какие сбои, задержки и иную неверную работу Сайта.</p>
        <p>
          3.6. Администрация Сайта имеет право в любой период времени менять внешний вид Сайта, его содержание, контент, функционал,
          изменять и (или) дополнять используемые скрипты, программное обеспечение и другие объекты авторского права, используемые или
          хранящиеся на Сайте, любые серверные приложения и дополнения в любое время с предварительным уведомлением или без такового
          Пользователя.
        </p>
        <p>
          3.7. Вид, форма, способ предоставления Пользователю доступа к использованию Сайта может изменяться, и Администрация Сайта
          оставляет за собой право не уведомлять Пользователя о планируемых или проведенных изменениях
        </p>
        <p>
          3.8. Ни при каких обстоятельствах Администрация Сайта или ее представители не несут ответственность перед Пользователем или
          перед любыми третьими лицами за любой косвенный, случайный, неумышленный ущерб, включая упущенную выгоду или потерянные
          данные, вред чести, достоинству или деловой репутации, вызванный в связи с использованием Сайта, содержимого Сайта или иных
          материалов, к которым Пользователь или иные лица получили доступ с помощью Сайта, даже если Администрация предупреждала или
          указывала на возможность такого вреда.
        </p>
        <h2>4. Обязанности Пользователя</h2>
        <p>Принимая условия настоящего Соглашения, Пользователь Сайта обязуется:</p>
        <p>4.1. Соблюдать положения действующего законодательства Российской Федерации и настоящего Соглашения.</p>
        <p>
          4.2. Предоставлять во всех регистрационных формах на Сайте достоверные, полные и актуальные данные, следить за их
          актуализацией.
        </p>
        <p>
          4.3. Не оставлять на Сайте комментарии и иные записи, противоречащие требованиям законодательства Российской Федерации и
          общепринятых норм морали и нравственности.
        </p>
        <p>
          4.4. Не размещать на Сайте информацию (включая персональную информацию других лиц) и объекты (включая ссылки на них), которые
          могут нарушать права и интересы других лиц.
        </p>
        <p>
          4.5. Не предоставлять другим Пользователям и третьим лицам ставшие ему известными в результате общения с другими
          Пользователями и иного использования Сайта персональные данные и информацию о частной жизни других Пользователей и третьих лиц
          без получения соответствующего предварительного разрешения последних.
        </p>
        <p>
          4.6. Не выполнять действий, которые могут привести к нарушению нормальной работы Сайта и сервисов Сайта, включая действия:
          причиняющие ущерб оборудованию Администрации Сайта, приводящие к сложностям в использовании Сайта другими Пользователями,
          ущербу персональных данных Пользователей Сайта.
        </p>
        <p>4.7 Не сообщать посреднику, выполняющему услугу на сайте цену в личной переписке</p>
        <h2>5. Конфиденциальность</h2>
        <p>
          Условия конфиденциальности информации, получаемой Администрацией Сайта от Пользователей Сайта, правила обработки персональных
          данных Пользователей Сайта располагаются по адресу: https://www.безпересдач.рф/privacy-policy/.
        </p>
        <h2>6. Заключительные положения</h2>
        <p>
          6.1. Условия настоящего Соглашения не обязывают Администрацию Сайта и Пользователя Сайта к реализации любого рода отношений
          (агентских, отношений по предполагаемой совместной деятельности и проч.), однозначно не прописанных в настоящем Соглашении.
        </p>
        <p>
          6.2. Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации. Вопросы, не
          урегулированные настоящим Соглашением, подлежат разрешению в соответствии с законодательством Российской Федерации. Все
          возможные споры, вытекающие из отношений, регулируемых настоящим Соглашением, разрешаются в порядке, установленном действующим
          законодательством Российской Федерации, по нормам российского права. Везде по тексту настоящего Соглашения, если явно не
          указано иное, под термином «законодательство» понимается законодательство Российской Федерации.
        </p>
        <p>
          6.3. Все споры и разногласия, возникающие между Пользователем и Администрацией Сайта, разрешаются сторонами путем переговоров.
          В случае невозможности разрешить споры и разногласия путем переговоров они подлежат рассмотрению в соответствующем суде по
          месту нахождения Администрации Сайта.
        </p>
        <p>
          6.4. Если по тем или иным причинам одно или несколько положений настоящего Соглашения будут признаны недействительными или не
          имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений настоящего
          Соглашения.
        </p>
      </div>
    </section>
  );
};
